Repository: plk3000/faro
Catalog: ios/FARO/Resources/Localizable.xcstrings
Source language: en
Languages: es_mx

# action.capture
source: Capture image
es_mx: Capturar imagen

# action.capturing
source: Capturing...
es_mx: Capturando...

# action.describe
source: Describe scene
es_mx: Describir escena

# action.describing
source: Describing...
es_mx: Describiendo...

# action.finishVoiceCommand
source: Finish voice command
es_mx: Finalizar comando de voz

# action.startNavigating
source: Start navigating
es_mx: Iniciar navegación

# action.startVoiceCommand
source: Start voice command
es_mx: Iniciar comando de voz

# action.stopNavigating
source: Stop navigating
es_mx: Detener navegación

# error.audioUnavailable
source: FARO could not start spoken audio.
es_mx: FARO no pudo iniciar el audio hablado.

# error.cameraConfiguration
source: The camera could not be configured.
es_mx: No se pudo configurar la cámara.

# error.cameraPermission
source: Camera access is not permitted.
es_mx: No se permitió el acceso a la cámara.

# error.cameraUnavailable
source: The camera is unavailable.
es_mx: La cámara no está disponible.

# error.captureFailed
source: The camera could not capture an image.
es_mx: La cámara no pudo capturar una imagen.

# error.captureInProgress
source: An image capture is already in progress.
es_mx: Ya hay una captura de imagen en curso.

# error.fixtureNotFound
source: The fixture image %@ could not be found.
es_mx: No se encontró la imagen de prueba %@.

# error.genericAction
source: FARO could not complete that action.
es_mx: FARO no pudo completar esa acción.

# error.invalidImageData
source: The captured image could not be read.
es_mx: No se pudo leer la imagen capturada.

# error.invalidVisionMode
source: Unknown FARO vision mode: %@.
es_mx: Modo de visión de FARO desconocido: %@.

# error.invalidVisionURL
source: Live vision mode requires an HTTPS base URL.
es_mx: El modo de visión en vivo requiere una URL base HTTPS.

# error.microphonePermission
source: Microphone permission is required for voice commands.
es_mx: Se necesita permiso para usar el micrófono con los comandos de voz.

# error.missingVisionToken
source: Live vision mode requires a service token.
es_mx: El modo de visión en vivo requiere un token de servicio.

# error.onDeviceSpeechUnavailable
source: On-device speech recognition is unavailable for the selected language.
es_mx: El reconocimiento de voz en el dispositivo no está disponible para el idioma seleccionado.

# error.speechAlreadyListening
source: FARO is already listening for a voice command.
es_mx: FARO ya está escuchando un comando de voz.

# error.speechAudioInput
source: FARO could not start microphone input.
es_mx: FARO no pudo iniciar la entrada del micrófono.

# error.speechNoInput
source: FARO did not hear a voice command.
es_mx: FARO no escuchó un comando de voz.

# error.speechPermission
source: Speech recognition permission is required for voice commands.
es_mx: Se necesita permiso para reconocer voz con los comandos de voz.

# error.speechRecognition
source: FARO could not recognize that speech.
es_mx: FARO no pudo reconocer lo que dijiste.

# error.speechRecognizerUnavailable
source: Speech recognition is temporarily unavailable.
es_mx: El reconocimiento de voz no está disponible temporalmente.

# error.storeDirectory
source: FARO could not create its image-storage folder.
es_mx: FARO no pudo crear la carpeta para guardar imágenes.

# error.storeInvalidImage
source: The captured image is invalid.
es_mx: La imagen capturada no es válida.

# error.storeJPEG
source: FARO could not convert the capture to JPEG.
es_mx: FARO no pudo convertir la captura a JPEG.

# error.storeList
source: FARO could not read the saved image list.
es_mx: FARO no pudo leer la lista de imágenes guardadas.

# error.storeWrite
source: FARO could not save the captured image.
es_mx: FARO no pudo guardar la imagen capturada.

# error.visionConfiguration
source: FARO vision configuration is invalid.
es_mx: La configuración de visión de FARO no es válida.

# error.visionInvalidResponse
source: The vision service returned an invalid response.
es_mx: El servicio de visión devolvió una respuesta no válida.

# error.visionNetwork
source: FARO could not reach the vision service.
es_mx: FARO no pudo comunicarse con el servicio de visión.

# error.visionRateLimited
source: The vision service is busy. Try again shortly.
es_mx: El servicio de visión está ocupado. Inténtalo de nuevo en un momento.

# error.visionRejected
source: The vision service rejected the image.
es_mx: El servicio de visión rechazó la imagen.

# error.visionTimeout
source: Scene description took too long.
es_mx: La descripción de la escena tardó demasiado.

# error.visionUnauthorized
source: The vision service rejected the app credentials.
es_mx: El servicio de visión rechazó las credenciales de la app.

# error.visionUnavailable
source: Scene description is temporarily unavailable.
es_mx: La descripción de escenas no está disponible temporalmente.

# error.voiceCommandRequiresNavigating
source: Start Navigating mode before using that command.
es_mx: Activa el modo Navegando antes de usar ese comando.

# error.voiceCommandUnrecognized
source: That command was not recognized. Try describe, where am I, remember this as, what is ahead, start navigation, or stop navigation.
es_mx: No se reconoció ese comando. Prueba describe, dónde estoy, recuerda este lugar como, qué hay delante, inicia navegación o detén navegación.

# error.voiceUnavailable
source: FARO could not find a voice for %@.
es_mx: FARO no encontró una voz para %@.

# handsFree.instructions
source: Enable once. While FARO is open in the foreground, say Hey FARO or Hola FARO, wait for the tone, then speak a command.
es_mx: Activa una vez. Mientras FARO esté abierto en primer plano, di Hey FARO u Hola FARO, espera el tono y después di un comando.

# handsFree.toggle
source: Hands-Free
es_mx: Manos libres

# hint.capture
source: Captures and saves one image from the rear camera
es_mx: Captura y guarda una imagen con la cámara trasera

# hint.describe
source: Captures an image and speaks a brief description
es_mx: Captura una imagen y dice una descripción breve

# hint.finishVoiceCommand
source: Stops recording and runs the recognized command
es_mx: Detiene la grabación y ejecuta el comando reconocido

# hint.handsFree
source: Keeps the microphone active while FARO is in the foreground. Say Hey FARO or Hola FARO, wait for the tone, then speak a command.
es_mx: Mantiene activo el micrófono mientras FARO está en primer plano. Di Hey FARO u Hola FARO, espera el tono y luego di un comando.

# hint.startNavigating
source: Enables navigation context and allows proximity feedback
es_mx: Activa el contexto de navegación y permite avisos de proximidad

# hint.startVoiceCommand
source: Starts a short on-device recording. Speak, then tap again
es_mx: Inicia una grabación breve en el dispositivo. Habla y vuelve a tocar el botón

# hint.stopNavigating
source: Disables navigation context and keeps proximity feedback silent
es_mx: Desactiva el contexto de navegación y silencia los avisos de proximidad

# hint.whereAmIRequiresNavigating
source: Start Navigating mode to use place recognition
es_mx: Activa el modo Navegando para usar el reconocimiento de lugares

# language.englishUS
source: English (US)
es_mx: Inglés (EE. UU.)

# language.followSystem
source: Follow iPhone
es_mx: Usar idioma del iPhone

# language.selector
source: Language
es_mx: Idioma

# language.spanishMexico
source: Spanish (Mexico)
es_mx: Español (México)

# mode.currentInactive
source: Current mode: Inactive
es_mx: Modo actual: Inactivo

# mode.currentNavigating
source: Current mode: Navigating
es_mx: Modo actual: Navegando

# mode.inactive
source: Inactive
es_mx: Inactivo

# mode.inactiveEnabled
source: Inactive mode on
es_mx: Modo Inactivo activado

# mode.label
source: Mode
es_mx: Modo

# mode.navigating
source: Navigating
es_mx: Navegando

# mode.navigatingEnabled
source: Navigating mode on
es_mx: Modo Navegando activado

# preview.latest
source: Latest captured image
es_mx: Última imagen capturada

# preview.rear
source: Rear camera preview
es_mx: Vista previa de la cámara trasera

# preview.simulatorLabel
source: Camera fixture preview. Capture an image to continue.
es_mx: Vista previa de prueba. Captura una imagen para continuar.

# preview.simulatorTitle
source: Simulator camera fixture
es_mx: Imagen de prueba del simulador

# saved.captureAccessibility
source: Capture saved %@
es_mx: Captura guardada %@

# saved.empty.description
source: Captured images will appear here.
es_mx: Las imágenes capturadas aparecerán aquí.

# saved.empty.title
source: No saved captures
es_mx: No hay capturas guardadas

# saved.hint
source: Shows the images saved on this device
es_mx: Muestra las imágenes guardadas en este dispositivo

# saved.title
source: Saved captures
es_mx: Capturas guardadas

# saved.titleCount
source: Saved captures (%@)
es_mx: Capturas guardadas (%@)

# scene.descriptionLabel
source: Scene description: %@
es_mx: Descripción de la escena: %@

# status.accessibility
source: Status: %@
es_mx: Estado: %@

# status.capturingImage
source: Capturing image
es_mx: Capturando imagen

# status.capturingScene
source: Capturing a scene to describe
es_mx: Capturando una escena para describirla

# status.describingScene
source: Describing scene
es_mx: Describiendo la escena

# status.descriptionReady
source: Description ready
es_mx: Descripción lista

# status.handsFree.executing
source: Running hands-free command
es_mx: Ejecutando el comando de manos libres

# status.handsFree.listening
source: Listening for Hey FARO or Hola FARO
es_mx: Escuchando Hey FARO u Hola FARO

# status.handsFree.off
source: Hands-Free is off
es_mx: Manos libres está desactivado

# status.handsFree.preparing
source: Preparing hands-free listening
es_mx: Preparando la escucha de manos libres

# status.handsFree.processing
source: Recognizing hands-free command
es_mx: Reconociendo el comando de manos libres

# status.handsFree.recording
source: Listening for your command
es_mx: Escuchando tu comando

# status.handsFree.wakeDetected
source: Wake phrase heard
es_mx: Frase de activación detectada

# status.imageCapturedSaved
source: Image captured and saved
es_mx: Imagen capturada y guardada

# status.ready
source: Ready to capture
es_mx: Listo para capturar

# status.voiceListening
source: Listening
es_mx: Escuchando

# status.voicePreparing
source: Preparing speech recognition
es_mx: Preparando el reconocimiento de voz

# status.voiceProcessing
source: Recognizing command
es_mx: Reconociendo el comando

# status.voiceReady
source: Ready for a voice command
es_mx: Listo para un comando de voz

# status.voiceRecognized
source: Recognized: %@
es_mx: Reconocido: %@

# voice.command.describe
source: Describe scene
es_mx: Describir escena

# voice.command.rememberPlace
source: Remember place
es_mx: Recordar lugar

# voice.command.startNavigating
source: Start navigation
es_mx: Iniciar navegación

# voice.command.stopNavigating
source: Stop navigation
es_mx: Detener navegación

# voice.command.whatIsAhead
source: What is ahead?
es_mx: ¿Qué hay delante?

# voice.command.whereAmI
source: Where am I?
es_mx: ¿Dónde estoy?

# voice.instructions
source: Tap once, say a command, then tap again. Try: describe; where am I; remember this as Kitchen; what is ahead; start navigation; stop navigation.
es_mx: Toca una vez, di un comando y vuelve a tocar. Prueba: describe; dónde estoy; recuerda este lugar como Cocina; qué hay delante; inicia navegación; detén navegación.

# voice.title
source: Voice command
es_mx: Comando de voz

# voice.transcript
source: Heard: %@
es_mx: Escuchado: %@
